Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# Hash_Target.Header
source: Range
ar: النطاق
cs: Rozsah
de: Bereich
el: Περιοχή
es: Intervalo
fa: محدوده
fr: Plage
hu: Tartomány
id: Rentang
it: Intervallo
ja: 対象範囲
ko: 범위
pl: Zakres
pt: Intervalo
ro: Interval
ru: Диапазон
th: ช่วง
tr: Aralık
uk: Діапазон
vi: Phạm vi
zh_hans: 范围
zh_hant: 範圍

# Hash_Target_Selection.Content
source: Selection
ar: التحديد
cs: Výběr
de: Auswahl
el: Επιλογή
es: Selección
fa: انتخاب
fr: Sélection
hu: Kijelölés
id: Pilihan
it: Selezione
ja: 選択範囲
ko: 선택 영역
pl: Zaznaczenie
pt: Seleção
ro: Selecție
ru: Выделение
th: ส่วนที่เลือก
tr: Seçim
uk: Виділення
vi: Vùng chọn
zh_hans: 选定内容
zh_hant: 選取範圍

# Hash_Target_Whole.Content
source: Whole document
ar: المستند بأكمله
cs: Celý dokument
de: Gesamtes Dokument
el: Ολόκληρο το έγγραφο
es: Todo el documento
fa: کل سند
fr: Document entier
hu: Teljes dokumentum
id: Seluruh dokumen
it: Intero documento
ja: ドキュメント全体
ko: 문서 전체
pl: Cały dokument
pt: Documento inteiro
ro: Tot documentul
ru: Весь документ
th: ทั้งเอกสาร
tr: Tüm belge
uk: Увесь документ
vi: Toàn bộ tài liệu
zh_hans: 整个文档
zh_hant: 整份文件

# Hash_Target_Custom.Content
source: Specify range
ar: تحديد نطاق
cs: Zadat rozsah
de: Bereich angeben
el: Καθορισμός περιοχής
es: Especificar intervalo
fa: تعیین محدوده
fr: Spécifier une plage
hu: Tartomány megadása
id: Tentukan rentang
it: Specifica intervallo
ja: 範囲を指定
ko: 범위 지정
pl: Określ zakres
pt: Especificar intervalo
ro: Specificare interval
ru: Указать диапазон
th: ระบุช่วง
tr: Aralık belirt
uk: Указати діапазон
vi: Chỉ định phạm vi
zh_hans: 指定范围
zh_hant: 指定範圍

# Hash_CustomStart.Header
source: Start
ar: البداية
cs: Začátek
de: Anfang
el: Αρχή
es: Inicio
fa: شروع
fr: Début
hu: Kezdet
id: Awal
it: Inizio
ja: 開始
ko: 시작
pl: Początek
pt: Início
ro: Început
ru: Начало
th: เริ่มต้น
tr: Başlangıç
uk: Початок
vi: Đầu
zh_hans: 开始
zh_hant: 開始

# Hash_CustomLength.Header
source: Length (empty: to the end)
ar: الطول (فارغ: حتى النهاية)
cs: Délka (prázdné: do konce)
de: Länge (leer: bis zum Ende)
el: Μήκος (κενό: έως το τέλος)
es: Longitud (vacío: hasta el final)
fa: طول (خالی: تا انتها)
fr: Longueur (vide : jusqu'à la fin)
hu: Hossz (üres: a végéig)
id: Panjang (kosong: hingga akhir)
it: Lunghezza (vuoto: fino alla fine)
ja: 長さ (空欄は末尾まで)
ko: 길이(비워 두면 끝까지)
pl: Długość (puste: do końca)
pt: Comprimento (vazio: até o fim)
ro: Lungime (gol: până la sfârșit)
ru: Длина (пусто: до конца)
th: ความยาว (เว้นว่าง: จนถึงจุดสิ้นสุด)
tr: Uzunluk (boş: sona kadar)
uk: Довжина (порожньо: до кінця)
vi: Độ dài (để trống: đến cuối)
zh_hans: 长度（留空表示到末尾）
zh_hant: 長度（空白：到結尾）

# Hash_CustomEnd_Header
source: End, inclusive (empty: to the end)
ar: النهاية، شاملة (فارغ: حتى النهاية)
cs: Konec, včetně (prázdné: do konce)
de: Ende, einschließlich (leer: bis zum Ende)
el: Τέλος, συμπεριλαμβάνεται (κενό: έως το τέλος)
es: Fin, incluido (vacío: hasta el final)
fa: پایان، شامل (خالی: تا انتها)
fr: Fin, incluse (vide : jusqu'à la fin)
hu: Vég, ezzel együtt (üres: a végéig)
id: Akhir, inklusif (kosong: hingga akhir)
it: Fine, inclusa (vuoto: fino alla fine)
ja: 終了 (このバイトを含む。空欄は末尾まで)
ko: 끝, 이 바이트 포함(비워 두면 끝까지)
pl: Koniec, włącznie (puste: do końca)
pt: Fim, inclusivo (vazio: até o fim)
ro: Sfârșit, inclusiv (gol: până la sfârșit)
ru: Конец включительно (пусто: до конца)
th: สิ้นสุด รวมไบต์นี้ (เว้นว่าง: จนถึงจุดสิ้นสุด)
tr: Bitiş, dahil (boş: sona kadar)
uk: Кінець, включно (порожньо: до кінця)
vi: Cuối, bao gồm (để trống: đến cuối)
zh_hans: 结束，含此字节（留空表示到末尾）
zh_hant: 結束，含此位元組（空白：到結尾）

# Hash_CustomEndKind.Header
source: Second field
ar: الحقل الثاني
cs: Druhé pole
de: Zweites Feld
el: Δεύτερο πεδίο
es: Segundo campo
fa: فیلد دوم
fr: Second champ
hu: Második mező
id: Kolom kedua
it: Secondo campo
ja: 2 つ目の欄
ko: 두 번째 필드
pl: Drugie pole
pt: Segundo campo
ro: Al doilea câmp
ru: Второе поле
th: ช่องที่สอง
tr: İkinci alan
uk: Друге поле
vi: Trường thứ hai
zh_hans: 第二个字段
zh_hant: 第二個欄位

# Hash_CustomEndKind_Length.Content
source: Length
ar: الطول
cs: Délka
de: Länge
el: Μήκος
es: Longitud
fa: طول
fr: Longueur
hu: Hossz
id: Panjang
it: Lunghezza
ja: 長さ
ko: 길이
pl: Długość
pt: Comprimento
ro: Lungime
ru: Длина
th: ความยาว
tr: Uzunluk
uk: Довжина
vi: Độ dài
zh_hans: 长度
zh_hant: 長度

# Hash_CustomEndKind_End.Content
source: End (inclusive)
ar: النهاية (شاملة)
cs: Konec (včetně)
de: Ende (einschließlich)
el: Τέλος (συμπεριλαμβάνεται)
es: Fin (incluido)
fa: پایان (شامل)
fr: Fin (incluse)
hu: Vég (ezzel együtt)
id: Akhir (inklusif)
it: Fine (inclusa)
ja: 終了 (このバイトを含む)
ko: 끝(이 바이트 포함)
pl: Koniec (włącznie)
pt: Fim (inclusivo)
ro: Sfârșit (inclusiv)
ru: Конец (включительно)
th: สิ้นสุด (รวมไบต์นี้)
tr: Bitiş (dahil)
uk: Кінець (включно)
vi: Cuối (bao gồm)
zh_hans: 结束（含此字节）
zh_hant: 結束（含此位元組）

# Hash_Range
source: {0}–{1} ({2} bytes)
ar: {0}–{1} ({2} بايت)
cs: {0}–{1} (bajty: {2})
el: {0}–{1} ({2} byte)
fa: {0}–{1} ({2} بایت)
fr: {0}–{1} ({2} octets)
hu: {0}–{1} ({2} bájt)
id: {0}–{1} ({2} byte)
it: {0}–{1} ({2} byte)
ja: {0}〜{1} ({2} バイト)
ko: {0}–{1}({2}바이트)
pl: {0}–{1} (bajty: {2})
ro: {0}–{1} ({2} octeți)
ru: {0}–{1} ({2} байт)
th: {0}–{1} ({2} ไบต์)
tr: {0}–{1} ({2} bayt)
uk: {0}–{1} ({2} байтів)
vi: {0}–{1} ({2} byte)
zh_hans: {0}–{1}（{2} 字节）
zh_hant: {0}–{1}（{2} 個位元組）

# Hash_RangeEmpty
source: {0} (0 bytes)
ar: {0} (0 بايت)
cs: {0} (0 bajtů)
el: {0} (0 byte)
fa: {0} (0 بایت)
fr: {0} (0 octet)
hu: {0} (0 bájt)
id: {0} (0 byte)
it: {0} (0 byte)
ja: {0} (0 バイト)
ko: {0}(0바이트)
pl: {0} (0 bajtów)
ro: {0} (0 octeți)
ru: {0} (0 байт)
th: {0} (0 ไบต์)
tr: {0} (0 bayt)
uk: {0} (0 байтів)
vi: {0} (0 byte)
zh_hans: {0}（0 字节）
zh_hant: {0}（0 個位元組）

# Hash_RangeInvalid
source: The range is outside the document.
ar: النطاق خارج المستند.
cs: Rozsah je mimo dokument.
de: Der Bereich liegt außerhalb des Dokuments.
el: Η περιοχή είναι εκτός του εγγράφου.
es: El intervalo está fuera del documento.
fa: محدوده خارج از سند است.
fr: La plage est en dehors du document.
hu: A tartomány a dokumentumon kívül esik.
id: Rentang berada di luar dokumen.
it: L'intervallo è esterno al documento.
ja: 範囲がドキュメントの外にあります。
ko: 범위가 문서 밖에 있습니다.
pl: Zakres wykracza poza dokument.
pt: O intervalo está fora do documento.
ro: Intervalul se află în afara documentului.
ru: Диапазон выходит за пределы документа.
th: ช่วงอยู่นอกเอกสาร
tr: Aralık belgenin dışında.
uk: Діапазон виходить за межі документа.
vi: Phạm vi nằm ngoài tài liệu.
zh_hans: 范围超出文档。
zh_hant: 範圍超出文件。

# Hash_Set.Header
source: Algorithm set
ar: مجموعة الخوارزميات
cs: Sada algoritmů
de: Algorithmengruppe
el: Σύνολο αλγορίθμων
es: Conjunto de algoritmos
fa: مجموعهٔ الگوریتم
fr: Jeu d'algorithmes
hu: Algoritmuskészlet
id: Set algoritma
it: Set di algoritmi
ja: セット
ko: 알고리즘 집합
pl: Zestaw algorytmów
pt: Conjunto de algoritmos
ro: Set de algoritmi
ru: Набор алгоритмов
th: ชุดอัลกอริทึม
tr: Algoritma kümesi
uk: Набір алгоритмів
vi: Bộ thuật toán
zh_hans: 算法集
zh_hant: 演算法組合

# Hash_Set_common
source: Common
ar: شائعة
cs: Běžné
de: Häufig verwendet
el: Συνήθεις
es: Habituales
fa: رایج
fr: Courants
hu: Gyakori
id: Umum
it: Comuni
ja: よく使う
ko: 자주 사용
pl: Popularne
pt: Comuns
ro: Uzuali
ru: Основные
th: ที่ใช้บ่อย
tr: Yaygın
uk: Поширені
vi: Thường dùng
zh_hans: 常用
zh_hant: 常用

# Hash_Set_cryptographic
source: Cryptographic hashes
ar: دوال التجزئة التشفيرية
cs: Kryptografické hashe
de: Kryptografische Hashes
el: Κρυπτογραφικοί κατακερματισμοί
es: Hashes criptográficos
fa: هش‌های رمزنگاری
fr: Hachages cryptographiques
hu: Kriptográfiai kivonatok
id: Hash kriptografis
it: Hash crittografici
ja: 暗号学的ハッシュ
ko: 암호화 해시
pl: Hashe kryptograficzne
pt: Hashes criptográficos
ro: Hash-uri criptografice
ru: Криптографические хэши
th: แฮชเข้ารหัสลับ
tr: Şifreleme karmaları
uk: Криптографічні хеші
vi: Hash mật mã
zh_hans: 加密哈希
zh_hant: 密碼編譯雜湊

# Hash_Set_checksums
source: Checksums
ar: المجاميع الاختبارية
cs: Kontrolní součty
de: Prüfsummen
el: Αθροίσματα ελέγχου
es: Sumas de comprobación
fa: چک‌سام‌ها
fr: Sommes de contrôle
hu: Ellenőrzőösszegek
id: Checksum
it: Checksum
ja: チェックサム
ko: 체크섬
pl: Sumy kontrolne
pt: Somas de verificação
ro: Sume de control
ru: Контрольные суммы
th: เช็กซัม
tr: Sağlama toplamları
uk: Контрольні суми
vi: Tổng kiểm tra
zh_hans: 校验和
zh_hant: 總和檢查碼

# Hash_SaveSet.Content
source: Save set
ar: حفظ المجموعة
cs: Uložit sadu
de: Gruppe speichern
el: Αποθήκευση συνόλου
es: Guardar conjunto
fa: ذخیرهٔ مجموعه
fr: Enregistrer le jeu
hu: Készlet mentése
id: Simpan set
it: Salva set
ja: セットを保存
ko: 집합 저장
pl: Zapisz zestaw
pt: Salvar conjunto
ro: Salvare set
ru: Сохранить набор
th: บันทึกชุด
tr: Kümeyi kaydet
uk: Зберегти набір
vi: Lưu bộ
zh_hans: 保存算法集
zh_hant: 儲存組合

# Hash_SetName.Header
source: Set name
ar: اسم المجموعة
cs: Název sady
de: Name der Gruppe
el: Όνομα συνόλου
es: Nombre del conjunto
fa: نام مجموعه
fr: Nom du jeu
hu: Készlet neve
id: Nama set
it: Nome del set
ja: セットの名前
ko: 집합 이름
pl: Nazwa zestawu
pt: Nome do conjunto
ro: Nume set
ru: Имя набора
th: ชื่อชุด
tr: Küme adı
uk: Назва набору
vi: Tên bộ
zh_hans: 算法集名称
zh_hant: 組合名稱

# Hash_SaveSetConfirm.Content
source: Save
ar: حفظ
cs: Uložit
de: Speichern
el: Αποθήκευση
es: Guardar
fa: ذخیره
fr: Enregistrer
hu: Mentés
id: Simpan
it: Salva
ja: 保存
ko: 저장
pl: Zapisz
pt: Salvar
ro: Salvare
ru: Сохранить
th: บันทึก
tr: Kaydet
uk: Зберегти
vi: Lưu
zh_hans: 保存
zh_hant: 儲存

# Hash_Filter.PlaceholderText
source: Filter algorithms
ar: تصفية الخوارزميات
cs: Filtrovat algoritmy
de: Algorithmen filtern
el: Φιλτράρισμα αλγορίθμων
es: Filtrar algoritmos
fa: فیلتر الگوریتم‌ها
fr: Filtrer les algorithmes
hu: Algoritmusok szűrése
id: Filter algoritma
it: Filtra algoritmi
ja: アルゴリズムを絞り込む
ko: 알고리즘 필터링
pl: Filtruj algorytmy
pt: Filtrar algoritmos
ro: Filtrare algoritmi
ru: Фильтр алгоритмов
th: กรองอัลกอริทึม
tr: Algoritmaları filtrele
uk: Фільтрувати алгоритми
vi: Lọc thuật toán
zh_hans: 筛选算法
zh_hant: 篩選演算法

# Hash_Filter.AutomationProperties.Name
source: Filter algorithms
ar: تصفية الخوارزميات
cs: Filtrovat algoritmy
de: Algorithmen filtern
el: Φιλτράρισμα αλγορίθμων
es: Filtrar algoritmos
fa: فیلتر الگوریتم‌ها
fr: Filtrer les algorithmes
hu: Algoritmusok szűrése
id: Filter algoritma
it: Filtra algoritmi
ja: アルゴリズムを絞り込む
ko: 알고리즘 필터링
pl: Filtruj algorytmy
pt: Filtrar algoritmos
ro: Filtrare algoritmi
ru: Фильтр алгоритмов
th: กรองอัลกอริทึม
tr: Algoritmaları filtrele
uk: Фільтрувати алгоритми
vi: Lọc thuật toán
zh_hans: 筛选算法
zh_hant: 篩選演算法

# Hash_Group_Checksum
source: Checksums
ar: المجاميع الاختبارية
cs: Kontrolní součty
de: Prüfsummen
el: Αθροίσματα ελέγχου
es: Sumas de comprobación
fa: چک‌سام‌ها
fr: Sommes de contrôle
hu: Ellenőrzőösszegek
id: Checksum
it: Checksum
ja: チェックサム
ko: 체크섬
pl: Sumy kontrolne
pt: Somas de verificação
ro: Sume de control
ru: Контрольные суммы
th: เช็กซัม
tr: Sağlama toplamları
uk: Контрольні суми
vi: Tổng kiểm tra
zh_hans: 校验和
zh_hant: 總和檢查碼

# Hash_Group_NonCryptographic
source: Non-cryptographic hashes
ar: دوال التجزئة غير التشفيرية
cs: Nekryptografické hashe
de: Nicht kryptografische Hashes
el: Μη κρυπτογραφικοί κατακερματισμοί
es: Hashes no criptográficos
fa: هش‌های غیررمزنگاری
fr: Hachages non cryptographiques
hu: Nem kriptográfiai kivonatok
id: Hash non-kriptografis
it: Hash non crittografici
ja: 非暗号学的ハッシュ
ko: 비암호화 해시
pl: Hashe niekryptograficzne
pt: Hashes não criptográficos
ro: Hash-uri necriptografice
ru: Некриптографические хэши
th: แฮชที่ไม่ใช่การเข้ารหัสลับ
tr: Şifreleme amaçlı olmayan karmalar
uk: Некриптографічні хеші
vi: Hash không mật mã
zh_hans: 非加密哈希
zh_hant: 非密碼編譯雜湊

# Hash_Group_Cryptographic
source: Cryptographic hashes
ar: دوال التجزئة التشفيرية
cs: Kryptografické hashe
de: Kryptografische Hashes
el: Κρυπτογραφικοί κατακερματισμοί
es: Hashes criptográficos
fa: هش‌های رمزنگاری
fr: Hachages cryptographiques
hu: Kriptográfiai kivonatok
id: Hash kriptografis
it: Hash crittografici
ja: 暗号学的ハッシュ
ko: 암호화 해시
pl: Hashe kryptograficzne
pt: Hashes criptográficos
ro: Hash-uri criptografice
ru: Криптографические хэши
th: แฮชเข้ารหัสลับ
tr: Şifreleme karmaları
uk: Криптографічні хеші
vi: Hash mật mã
zh_hans: 加密哈希
zh_hant: 密碼編譯雜湊

# Hash_Alg_sum8
source: Sum 8-bit
ar: مجموع 8 بت
cs: Součet 8 bitů
de: Summe 8 Bit
el: Άθροισμα 8 bit
es: Suma de 8 bits
fa: جمع 8 بیتی
fr: Somme 8 bits
hu: Összeg, 8 bites
id: Jumlah 8-bit
it: Somma a 8 bit
ja: 加算 8 bit
ko: 합계 8비트
pl: Suma 8-bitowa
pt: Soma de 8 bits
ro: Sumă pe 8 biți
ru: Сумма, 8 бит
th: ผลรวม 8 บิต
tr: Toplam 8 bit
uk: Сума, 8 біт
vi: Tổng 8 bit
zh_hans: 求和 8 位
zh_hant: 加總 8 位元

# Hash_Alg_sum16
source: Sum 16-bit
ar: مجموع 16 بت
cs: Součet 16 bitů
de: Summe 16 Bit
el: Άθροισμα 16 bit
es: Suma de 16 bits
fa: جمع 16 بیتی
fr: Somme 16 bits
hu: Összeg, 16 bites
id: Jumlah 16-bit
it: Somma a 16 bit
ja: 加算 16 bit
ko: 합계 16비트
pl: Suma 16-bitowa
pt: Soma de 16 bits
ro: Sumă pe 16 biți
ru: Сумма, 16 бит
th: ผลรวม 16 บิต
tr: Toplam 16 bit
uk: Сума, 16 біт
vi: Tổng 16 bit
zh_hans: 求和 16 位
zh_hant: 加總 16 位元

# Hash_Alg_sum32
source: Sum 32-bit
ar: مجموع 32 بت
cs: Součet 32 bitů
de: Summe 32 Bit
el: Άθροισμα 32 bit
es: Suma de 32 bits
fa: جمع 32 بیتی
fr: Somme 32 bits
hu: Összeg, 32 bites
id: Jumlah 32-bit
it: Somma a 32 bit
ja: 加算 32 bit
ko: 합계 32비트
pl: Suma 32-bitowa
pt: Soma de 32 bits
ro: Sumă pe 32 de biți
ru: Сумма, 32 бита
th: ผลรวม 32 บิต
tr: Toplam 32 bit
uk: Сума, 32 біти
vi: Tổng 32 bit
zh_hans: 求和 32 位
zh_hant: 加總 32 位元

# Hash_Alg_xor8
source: XOR 8-bit
ar: XOR 8 بت
cs: XOR 8 bitů
es: XOR de 8 bits
fa: XOR 8 بیتی
fr: XOR 8 bits
hu: XOR, 8 bites
it: XOR a 8 bit
ko: XOR 8비트
pl: XOR 8-bitowy
pt: XOR de 8 bits
ro: XOR pe 8 biți
ru: XOR, 8 бит
th: XOR 8 บิต
uk: XOR, 8 біт
zh_hans: XOR 8 位
zh_hant: XOR 8 位元

# Hash_Unavailable
source: Not available on this system
ar: غير متاح على هذا النظام
cs: V tomto systému není k dispozici
de: Auf diesem System nicht verfügbar
el: Δεν είναι διαθέσιμο σε αυτό το σύστημα
es: No disponible en este sistema
fa: در این سیستم در دسترس نیست
fr: Non disponible sur ce système
hu: Ezen a rendszeren nem érhető el
id: Tidak tersedia di sistem ini
it: Non disponibile in questo sistema
ja: この環境では利用できません
ko: 이 시스템에서 사용할 수 없음
pl: Niedostępne w tym systemie
pt: Não disponível neste sistema
ro: Indisponibil pe acest sistem
ru: Недоступно в этой системе
th: ไม่พร้อมใช้งานบนระบบนี้
tr: Bu sistemde kullanılamıyor
uk: Недоступно в цій системі
vi: Không khả dụng trên hệ thống này
zh_hans: 在此系统上不可用
zh_hant: 此系統上無法使用

# Hash_Insecure
source: Not secure: don't use it to detect tampering.
ar: غير آمنة: لا تستخدمها لاكتشاف التلاعب.
cs: Není bezpečné: nepoužívejte k odhalení neoprávněných změn.
de: Nicht sicher: Nicht zum Erkennen von Manipulationen verwenden.
el: Μη ασφαλές: μην το χρησιμοποιείτε για τον εντοπισμό παραποίησης.
es: No es seguro: no lo uses para detectar manipulaciones.
fa: امن نیست: برای تشخیص دستکاری از آن استفاده نکنید.
fr: Non sécurisé : ne l'utilisez pas pour détecter une falsification.
hu: Nem biztonságos: ne használja manipuláció észlelésére.
id: Tidak aman: jangan gunakan untuk mendeteksi perusakan.
it: Non sicuro: non usarlo per rilevare manomissioni.
ja: 安全ではありません (改ざんの検出には使わないでください)。
ko: 안전하지 않음: 변조 감지에는 사용하지 마세요.
pl: Niezabezpieczone: nie używaj do wykrywania manipulacji.
pt: Não é seguro: não use para detectar adulterações.
ro: Nesigur: nu îl utilizați pentru a detecta modificări neautorizate.
ru: Небезопасно: не используйте для обнаружения подделки.
th: ไม่ปลอดภัย: อย่าใช้เพื่อตรวจหาการปลอมแปลง
tr: Güvenli değil: kurcalamayı algılamak için kullanmayın.
uk: Небезпечний: не використовуйте його для виявлення підробок.
vi: Không an toàn: đừng dùng để phát hiện giả mạo.
zh_hans: 不安全：请勿用于检测篡改。
zh_hant: 不安全：請勿用來偵測竄改。

# Hash_Compute.Content
source: Calculate
ar: حساب
cs: Vypočítat
de: Berechnen
el: Υπολογισμός
es: Calcular
fa: محاسبه
fr: Calculer
hu: Számítás
id: Hitung
it: Calcola
ja: 計算
ko: 계산
pl: Oblicz
pt: Calcular
ro: Calculare
ru: Вычислить
th: คำนวณ
tr: Hesapla
uk: Обчислити
vi: Tính
zh_hans: 计算
zh_hant: 計算

# Hash_Cancel.Content
source: Cancel
ar: إلغاء
cs: Zrušit
de: Abbrechen
el: Άκυρο
es: Cancelar
fa: لغو
fr: Annuler
hu: Mégse
id: Batal
it: Annulla
ja: キャンセル
ko: 취소
pl: Anuluj
pt: Cancelar
ro: Anulare
ru: Отмена
th: ยกเลิก
tr: İptal
uk: Скасувати
vi: Hủy
zh_hans: 取消
zh_hant: 取消

# Hash_Auto.Content
source: Recalculate automatically
ar: إعادة الحساب تلقائياً
cs: Přepočítávat automaticky
de: Automatisch neu berechnen
el: Αυτόματος επανυπολογισμός
es: Recalcular automáticamente
fa: محاسبهٔ مجدد خودکار
fr: Recalculer automatiquement
hu: Automatikus újraszámítás
id: Hitung ulang otomatis
it: Ricalcola automaticamente
ja: 自動で再計算
ko: 자동으로 다시 계산
pl: Przeliczaj automatycznie
pt: Recalcular automaticamente
ro: Recalculare automată
ru: Пересчитывать автоматически
th: คำนวณใหม่โดยอัตโนมัติ
tr: Otomatik olarak yeniden hesapla
uk: Перераховувати автоматично
vi: Tự động tính lại
zh_hans: 自动重新计算
zh_hant: 自動重新計算

# Hash_NoAlgorithm
source: Select at least one algorithm.
ar: حدد خوارزمية واحدة على الأقل.
cs: Vyberte alespoň jeden algoritmus.
de: Wählen Sie mindestens einen Algorithmus aus.
el: Επιλέξτε τουλάχιστον έναν αλγόριθμο.
es: Selecciona al menos un algoritmo.
fa: دست‌کم یک الگوریتم انتخاب کنید.
fr: Sélectionnez au moins un algorithme.
hu: Válasszon ki legalább egy algoritmust.
id: Pilih setidaknya satu algoritma.
it: Seleziona almeno un algoritmo.
ja: アルゴリズムを 1 つ以上選んでください。
ko: 알고리즘을 하나 이상 선택하세요.
pl: Wybierz co najmniej jeden algorytm.
pt: Selecione pelo menos um algoritmo.
ro: Selectați cel puțin un algoritm.
ru: Выберите хотя бы один алгоритм.
th: โปรดเลือกอัลกอริทึมอย่างน้อยหนึ่งรายการ
tr: En az bir algoritma seçin.
uk: Виберіть принаймні один алгоритм.
vi: Hãy chọn ít nhất một thuật toán.
zh_hans: 请至少选择一种算法。
zh_hant: 請至少選取一個演算法。

# Hash_Cancelled
source: The calculation was canceled.
ar: تم إلغاء الحساب.
cs: Výpočet byl zrušen.
de: Die Berechnung wurde abgebrochen.
el: Ο υπολογισμός ακυρώθηκε.
es: Se canceló el cálculo.
fa: محاسبه لغو شد.
fr: Le calcul a été annulé.
hu: A számítás megszakítva.
id: Perhitungan dibatalkan.
it: Il calcolo è stato annullato.
ja: 計算をキャンセルしました。
ko: 계산이 취소되었습니다.
pl: Obliczanie zostało anulowane.
pt: O cálculo foi cancelado.
ro: Calculul a fost anulat.
ru: Вычисление отменено.
th: ยกเลิกการคำนวณแล้ว
tr: Hesaplama iptal edildi.
uk: Обчислення скасовано.
vi: Đã hủy phép tính.
zh_hans: 已取消计算。
zh_hant: 已取消計算。

# Hash_ReadError
source: Can't calculate because offset {0} can't be read.
ar: يتعذّر الحساب لأنه تتعذّر قراءة الإزاحة {0}.
cs: Výpočet nelze provést, protože posun {0} nelze přečíst.
de: Berechnung nicht möglich, da Offset {0} nicht gelesen werden kann.
el: Δεν είναι δυνατός ο υπολογισμός, επειδή η μετατόπιση {0} δεν μπορεί να διαβαστεί.
es: No se puede calcular porque no se puede leer el desplazamiento {0}.
fa: محاسبه ممکن نیست، زیرا آفست {0} قابل خواندن نیست.
fr: Calcul impossible, car le décalage {0} ne peut pas être lu.
hu: Nem számítható ki, mert a(z) {0} eltolás nem olvasható.
id: Tidak dapat menghitung karena offset {0} tidak dapat dibaca.
it: Impossibile calcolare perché non è possibile leggere l'offset {0}.
ja: オフセット {0} を読み込めないため計算できません。
ko: 오프셋 {0}을(를) 읽을 수 없어 계산할 수 없습니다.
pl: Nie można obliczyć, ponieważ nie można odczytać przesunięcia {0}.
pt: Não é possível calcular porque o deslocamento {0} não pode ser lido.
ro: Nu se poate calcula, deoarece deplasamentul {0} nu poate fi citit.
ru: Не удается вычислить: невозможно прочитать данные по смещению {0}.
th: ไม่สามารถคำนวณได้ เนื่องจากไม่สามารถอ่านออฟเซ็ต {0} ได้
tr: {0} ofseti okunamadığından hesaplanamıyor.
uk: Не вдається обчислити, оскільки не вдається прочитати зміщення {0}.
vi: Không thể tính vì không đọc được độ lệch {0}.
zh_hans: 无法读取偏移量 {0}，因此无法计算。
zh_hant: 無法讀取位移 {0}，因此無法計算。

# Hash_Stale.Message
source: The results are for the content before the edits.
ar: النتائج تخص المحتوى قبل التعديلات.
cs: Výsledky platí pro obsah před úpravami.
de: Die Ergebnisse beziehen sich auf den Inhalt vor den Änderungen.
el: Τα αποτελέσματα αφορούν το περιεχόμενο πριν από τις επεξεργασίες.
es: Los resultados corresponden al contenido anterior a las ediciones.
fa: نتایج مربوط به محتوای پیش از ویرایش‌ها است.
fr: Les résultats concernent le contenu avant les modifications.
hu: Az eredmények a szerkesztések előtti tartalomra vonatkoznak.
id: Hasil ini untuk konten sebelum pengeditan.
it: I risultati si riferiscono al contenuto precedente alle modifiche.
ja: 結果は編集前の内容のものです。
ko: 결과는 편집 전 내용에 대한 것입니다.
pl: Wyniki dotyczą zawartości sprzed zmian.
pt: Os resultados são do conteúdo anterior às edições.
ro: Rezultatele corespund conținutului de dinainte de editări.
ru: Результаты относятся к содержимому до изменений.
th: ผลลัพธ์เป็นของเนื้อหาก่อนการแก้ไข
tr: Sonuçlar, düzenlemelerden önceki içeriğe aittir.
uk: Результати стосуються вмісту до внесення змін.
vi: Kết quả là của nội dung trước khi chỉnh sửa.
zh_hans: 结果对应的是编辑前的内容。
zh_hant: 結果是針對編輯前的內容。

# Hash_Recompute.Content
source: Recalculate
ar: إعادة الحساب
cs: Přepočítat
de: Neu berechnen
el: Επανυπολογισμός
es: Recalcular
fa: محاسبهٔ مجدد
fr: Recalculer
hu: Újraszámítás
id: Hitung ulang
it: Ricalcola
ja: 再計算
ko: 다시 계산
pl: Przelicz ponownie
pt: Recalcular
ro: Recalculare
ru: Пересчитать
th: คำนวณใหม่
tr: Yeniden hesapla
uk: Перерахувати
vi: Tính lại
zh_hans: 重新计算
zh_hant: 重新計算

# Hash_Format.Header
source: Format
ar: التنسيق
cs: Formát
el: Μορφή
es: Formato
fa: قالب
hu: Formátum
it: Formato
ja: 表示形式
ko: 형식
pt: Formato
ru: Формат
th: รูปแบบ
tr: Biçim
uk: Формат
vi: Định dạng
zh_hans: 格式
zh_hant: 格式

# Hash_Format_HexUpper.Content
source: Hex (uppercase)
ar: Hex (أحرف كبيرة)
cs: Hex (velká písmena)
de: Hex (Großbuchstaben)
el: Hex (κεφαλαία)
es: Hex (mayúsculas)
fa: Hex (حروف بزرگ)
fr: Hex (majuscules)
hu: Hex (nagybetűs)
id: Hex (huruf besar)
it: Hex (maiuscolo)
ja: Hex 大文字
ko: Hex(대문자)
pl: Hex (wielkie litery)
pt: Hex (maiúsculas)
ro: Hex (majuscule)
ru: Hex (прописные)
th: Hex (ตัวพิมพ์ใหญ่)
tr: Hex (büyük harf)
uk: Hex (великі літери)
vi: Hex (chữ hoa)
zh_hans: Hex（大写）
zh_hant: Hex（大寫）

# Hash_Format_HexLower.Content
source: Hex (lowercase)
ar: Hex (أحرف صغيرة)
cs: Hex (malá písmena)
de: Hex (Kleinbuchstaben)
el: Hex (πεζά)
es: Hex (minúsculas)
fa: Hex (حروف کوچک)
fr: Hex (minuscules)
hu: Hex (kisbetűs)
id: Hex (huruf kecil)
it: Hex (minuscolo)
ja: Hex 小文字
ko: Hex(소문자)
pl: Hex (małe litery)
pt: Hex (minúsculas)
ro: Hex (minuscule)
ru: Hex (строчные)
th: Hex (ตัวพิมพ์เล็ก)
tr: Hex (küçük harf)
uk: Hex (малі літери)
vi: Hex (chữ thường)
zh_hans: Hex（小写）
zh_hant: Hex（小寫）

# Hash_Format_Decimal.Content
source: Decimal (64-bit or less)
ar: عشري (64 بت أو أقل)
cs: Desítkově (64 bitů nebo méně)
de: Dezimal (64 Bit oder weniger)
el: Δεκαδικό (έως 64 bit)
es: Decimal (64 bits o menos)
fa: دهدهی (64 بیتی یا کمتر)
fr: Décimal (64 bits ou moins)
hu: Decimális (legfeljebb 64 bites)
id: Desimal (64-bit atau kurang)
it: Decimale (64 bit o meno)
ja: 10 進 (64 bit 以下)
ko: 10진수(64비트 이하)
pl: Dziesiętny (do 64 bitów)
pt: Decimal (64 bits ou menos)
ro: Zecimal (64 de biți sau mai puțin)
ru: Десятичный (не более 64 бит)
th: ฐานสิบ (64 บิตหรือน้อยกว่า)
tr: Ondalık (64 bit veya daha az)
uk: Десятковий (до 64 біт)
vi: Thập phân (tối đa 64 bit)
zh_hans: 十进制（64 位或以下）
zh_hant: 十進位（64 位元以下）
